{
  "info": [
    {
      "id": 1,
      "title": "Java",
      "link": "/javaExamples",
      "text": "Here you can find some Java projects I have made during my studies. My first touch to language was trough mobile solutions on first year of my engineering studies. Quickly it became my favourite language for programming, which lead me to deepen my skills during studies with projects and courses.",
      "picture": "programming_logos_java.png",
      "alt": "Symbol of Java"
    },
    {
      "id": 2,
      "title": "JavaScript, HTML, CSS, PHP",
      "link": "/javascriptExamples",
      "text": "Here you can find some web projects I made during years before and during my current studies. My first touch to web development was during Vocational College, where we had multiple courses of HTML, CSS, PHP, and a little bit of JavaScript. Back then I found my interest towards programming.",
      "picture": "programming_logos_js.png",
      "alt": "Symbol of JavaScript and Node.js"
    },
    {
      "id": 3,
      "title": "C#",
      "link": "/csharpExamples",
      "text": "Here you can find some game development projects I have carried out using C#. My first touch to language was on first year of my current engineering studies, at game development period. I have found game development and C# as interesting and fun thing to do, even on my spare time. Therefore, I am participating on bigger game project with multiple people and to smaller game project I am making with my friends.",
      "picture": "programming_logos_csharp.png",
      "alt": "Symbol of C sharp"
    },
    {
      "id": 4,
      "title": "C/C++",
      "link": "/cExamples",
      "text": "Here you can find some practises and projects made with C/C++. My first touch to C-languages were on my first year of current engineering studies. C-languages were taught trough basics and robotics. Later I have deepened my skills with extra courses that went trough the basics of both languages, object-oriented programming using pointers and much more.",
      "picture": "programming_logos_c.png",
      "alt": "Symbol of C"
    }
  ],
  "js": [
    {
      "id": 1,
      "title": "The King's Road: Tales from the North",
      "tech": "WordPress, PHP, CSS, HTML",
      "text": "This project is part of bigger game project, hosted by University of Eastern Finland and Kuninkaantie RY. I am building a website to inform and promote about two games that are under development. Both games are in same series and will be presented side by side in website. I am working as web developer in the project. Website is on Wordpress platform and theme is completely made by me. I used my knowledge on PHP, HTML and CSS to create the theme. The website is still under the development, and it will be finished when overall theme around the games in decided.",
      "gitLink": null,
      "link": "https://thekingsroadgame.com/",
      "picture": "150x150.png",
      "alt": "Placeholder",
      "year": "2021",
      "team": 1
    },
    {
      "id": 2,
      "title": "Portfolio",
      "tech": "JavaScript, Node.js, React, CSS, JSON",
      "text": "This portfolio is project of mine. The older portfolio, - that you can find link to from below, - was made back 2016 when I first started my web development studies back in Vocational College. The website was on wordpress and made with it, I no longer felt like it truly presented my skills and knowledge of topic. So, I began what any programmer would do, make my own, with the tools and knowledge earned from my studies. This website is created with HTML, CSS and Javascript using React library.  All project info come from JSON file for easy implementation.",
      "gitLink": "https://github.com/Helveeti/Portfolio-V-Ahlsten",
      "link": null,
      "picture": "150x150.png",
      "alt": "Placeholder",
      "year": "2021",
      "team": 1
    },
    {
      "id": 3,
      "title": "Never have I ever - React Project",
      "tech": "JavaScript, Node.js, React, SQL, CSS",
      "text": "This project was planned to be part of bigger project. There was planned to make a mobile app game ‘Never have I ever’, that this website would be used to add or delete different prompts from. This is React version of website that I made as web development course project. Project includes logging in and signing up as user and everything needed to make it secure.",
      "gitLink": "https://github.com/Helveeti/Never-have-I-ever-webproject-React",
      "link": null,
      "picture": "never-ever_react.jpg",
      "alt": "Pictures of project's different pages.",
      "year": "2021",
      "team": 1
    },
    {
      "id": 4,
      "title": "Never have I ever - Vue Project",
      "tech": "JavaScript, Node.js, Vue.js, SQL",
      "text": "This project was planned to be part of bigger project. There was planned to make a mobile app game ‘Never have I ever’, that this website would be used to add or delete different prompts from. This is Vue version of website that I made as web development course project. Project includes logging in and everything needed to make it secure.",
      "gitLink": "https://github.com/Helveeti/Never-have-I-ever---Web-project",
      "link": null,
      "picture": "never-ever_vue.jpg",
      "alt": "Pictures of project's different pages.",
      "year": "2020",
      "team": 1
    },
    {
      "id": 5,
      "title": "Library API",
      "tech": "JavaScript, AJAX, HTML, CSS",
      "text": "This project was made in team of four during my first year and period of Engineering studies. It was team of four and the two of team focused on AJAX and Javascript part of project and me and other focused on making the website dynamic and responsive, since I already had most experience of it.",
      "gitLink": "https://github.com/Helveeti/Kirjasto-API",
      "link": "https://users.metropolia.fi/~veerapah/kirjastotproject_ver4/index.html",
      "picture": "library_api.PNG",
      "alt": "View of the website.",
      "year": "2019",
      "team": 4
    },
    {
      "id": 6,
      "title": "Interactive digital tree - TYKKI-project of Helsinki city",
      "tech": "JavaScript, HTML, CSS",
      "text": "This project was made for City of Helsinki, for their TYKKI-project. They wanted an interactive website implementation with graphic design for tree including various items. They wanted two websites, one with interactive elements such textboxes, prompts and printing possibility and other website with just static elements such as design and prompts. I created the websites using HTML, CSS and Javascript. This was one of last projects I made before graduating as media-assistant.",
      "gitLink": null,
      "link": "http://www.tyoelamayhteistyo.com/hedelmapuu/hedelmapuu.html",
      "picture": "tykkipuu.png",
      "alt": "TYKKI project's tree.",
      "year": "2018",
      "team": 1
    },
    {
      "id": 7,
      "title": "Mediastadi goes TFF",
      "tech": "WordPress, CSS",
      "text": "This project was made for Mediastadi goes TFF-event for updating news and info about the event. Website is made using wordpress platform and some CSS code. Even though team was big as 8 people, I took responsibility of production of website.",
      "gitLink": null,
      "link": "http://stadinao.eu/PROJEKTIT/TFF/",
      "picture": "tff_logo.PNG",
      "alt": "Mediastadi goes TFF logo.",
      "year": "2018",
      "team": 8
    },
    {
      "id": 8,
      "title": "Initiative box - Helsinki's Vocational College",
      "tech": "PHP, HTML, CSS",
      "text": "This is project of Initiative box for Helsinki’s Vocational College I studied at when one of my teachers asked me to make this for them. The site was built with simple HTML, CSS, and PHP. The website saves new user inputs to file and reads all the inputs from the file.",
      "gitLink": null,
      "link": "http://stadinao.eu/PROJEKTIT/Aloitelaatikko/kayttoehdot.php",
      "picture": "aloitelaatikko.PNG",
      "alt": "First view of Initiative box.",
      "year": "2018",
      "team": 1
    },
    {
      "id": 9,
      "title": "CityKani - participate form",
      "tech": "PHP, HTML, CSS",
      "text": "This website was part of event which was held in Helsinki’s Vocational College. It was an animation festival for amateurs and students. This event was held by my class in 2017 and needed the participate form, so people could take part to festival and submit their works. Website was made with HTML, CSS, and PHP.",
      "gitLink": null,
      "link": "http://stadinao.eu/PROJEKTIT/CITYKANI/Ilmoittautuminen/etusivu.html",
      "picture": "citykani_logo.PNG",
      "alt": "Citykani event's logo.",
      "year": "2017",
      "team": 1
    }
  ,
    {
      "id": 10,
      "title": "CityKani - voting form",
      "tech": "PHP, HTML, CSS",
      "text": "This website was part of event which was held in Helsinki’s Vocational College. It was an animation festival for amateurs and students. This event was held by my class in 2017 and needed voting form, for deciding whose animation would receive the trophy. Website was made with HTML, CSS, and PHP.",
      "gitLink": null,
      "link": "http://stadinao.eu/PROJEKTIT/CITYKANI/Ilmoittautuminen/aanestys.php",
      "picture": "citykani_logo.PNG",
      "alt": "Citykani event's logo.",
      "year": "2017",
      "team": 1
    },
    {
      "id": 11,
      "title": "CityKani",
      "tech": "Wordpress, CSS",
      "text": "Citykani was an animation festival for amateurs and students to participate to. Original host is Helsinki Vocational College, which students host them every year. In 2017, it was my class turn to host it and event like that needs a website. I took responsibility of production, and it was one of my first web development projects. Website was made with WordPress platform and some CSS.",
      "gitLink": null,
      "link": "http://citykani.fi/",
      "picture": "citykani_title.PNG",
      "alt": "Citykani's page's title and event information.",
      "year": "2017",
      "team": 10
    },
    {
      "id": 12,
      "title": "Old Portfolio",
      "tech": "Wordpress, CSS",
      "text": "This project was the very first web project I have made during my media-assistant studies. It was made on WordPress platform using their tools and CSS for customization. It was a good point to start learning, but I remember the frustration of the limits it gave. Not everything could be done with just CSS. And the same frustration pushed me learn more and this website you are reading this from, is a result of that thrive.",
      "gitLink": null,
      "link": "http://stadinao.eu/RYHMAT/16D/Ahlsten/portfolio/",
      "picture": "old_portfolio.PNG",
      "alt": "Title logo from old Portfolio.",
      "year": "2016",
      "team": 1
    }
  ],
  "java": [
    {
      "id": 1,
      "title": "Basic Rock-Paper-Scissors",
      "tech": "Java, Maven, JUnit5",
      "text": "Basic paper-rock-scissors game, to demonstrate how I structure programs in Java and overall basic skill usage.",
      "gitLink": "https://github.com/Helveeti/Basic-Rock-Paper-Scissors",
      "picture": "150x150.png",
      "alt": "Placeholder.",
      "year": "2021",
      "team": 1
    },
    {
      "id": 2,
      "title": "Reservice",
      "tech": "Java, JavaFX, Maven, JUnit5, Jenkins, SQL, Hibernate, Nektion",
      "text": "A bigger project made in school. This project took two periods to make, and it was made in team of four. We wanted to create a program for smaller or medium sized companies to help manage meeting room reservations. Our database was in virtual Linux computer and our testing were made with Jenkins and Junit5 tests.",
      "gitLink": "https://github.com/Helveeti/Reservice",
      "picture": "150x150.png",
      "alt": "Placeholder.",
      "year": "2020",
      "team": 4
    },
    {
      "id": 3,
      "title": "F1-remote controlled robot",
      "tech": "Java, SceneBuilder, SQL",
      "text": "Project of remote-controlled robot, done in first period of my major studies in engineering. Robot was built from Lego Mindstorms. Project was made in team of four, from two focused on building robot and I was on other two who focused on programming.",
      "gitLink": "https://github.com/Helveeti/F1-kauko-ohjattava-robotti",
      "picture": "150x150.png",
      "alt": "Placeholder.",
      "year": "2020",
      "team": 4
    },
    {
      "id": 4,
      "title": "Mobile App - Antidarra",
      "tech": "Java, Android",
      "text": "This project was first I have made in Java. The project was done in team of three, but still it was done mostly by me. Mobile app was made for students to keep count of drinks they have drank and to keep count how much water you should drink to compensate. And how long it will take before all the alcohol has been decreased from your body. The mobile app includes a quiz about your drinking habits. ",
      "gitLink": "https://github.com/Helveeti/Mobile-App---Antidarra",
      "picture": "150x150.png",
      "alt": "Placeholder.",
      "year": "2019",
      "team": 3
    }
  ],
  "cSharp": [
    {
      "id": 1,
      "title": "Game Jam 2021 - WellLost",
      "tech": "C#, Unity",
      "text": "Game Jam participation project made with theme finding. So, we made a game about a little robot toy which owner threw them to well and its parts scattered all over. You need to find the parts and find your way out of well. During the way you get a peek to a little robot's mind and thoughts of abandonment. There was team of five, I participated as programmer, two participated as artist, one was storyteller and one as catering. It was rough to be only programmer in this project, but I was glad to still get whole working game and try how much code I can write in 48 hours.\n",
      "gitLink": "https://github.com/Helveeti/GameJam2021-WellLost/tree/main/Scripts",
      "videoLink": "https://youtu.be/5MaZqSm7-C4",
      "link": "https://globalgamejam.org/2021/games/well-lost-5",
      "picture": "wellLost.PNG",
      "alt": "Picture of the game WellLost.",
      "year": "2021",
      "team": 5
    },
    {
      "id": 2,
      "title": "C-ee - Game Project",
      "tech": "C#, Unity",
      "text": "A project made I helped my friends with. They had game development course on LAB Institute of Design and Fine Arts, and as their final project, they developed a game. They did not have knowledge or skillset to program their game, so I offered to help them with it. So, I ended up as only programmer in the project. Overall, there was four artists on team and I as programmer. After the course ended, we have kept developing the game afterwards as smaller team of three. The game itself is 2D puzzle game, where main character founds a mansion in the woods, where a long-passed scientist does not know how to move on. The player must solve all the puzzles to help scientist move to after life.",
      "gitLink": "https://github.com/Helveeti/-C-ee---Game-project/tree/main/Scripts",
      "videoLink": "https://youtu.be/FxGwqrMLolk",
      "link": null,
      "picture": "c-ee.PNG",
      "alt": "Picture of the gameplay of C-ee.",
      "year": "2020 - 2021",
      "team": 5
    },
    {
      "id": 3,
      "title": "AMAZEING - Game Project",
      "tech": "C#, Unity",
      "text": "First game project since Flappy Bird-copy I made back 9th grade’s math club. This project was made in first year of my engineering studies. The game itself starts from the yard of your house. You have dropped your stuffed animals to the well and you must get them before parents notice you are gone. First you look for flashlight and then you climb down. Under the well there is a monster that tries to catch you and you can not stay too long or you will run out of breath. Before the monster catches you or you run out of time, you must collect all five toys and leave. The well itself is a labyrinth that is generated to unique one with every playthrough.",
      "gitLink": "https://github.com/Helveeti/AMAZING",
      "videoLink": "https://youtu.be/z_zZv2lVu-Y",
      "link": null,
      "picture": "amazeing.PNG",
      "alt": "Picture of the gameplay of Amazeing.",
      "year": "2019",
      "team": 3
    }
  ],
  "c": [
    {
      "id": 1,
      "title": "Travel card system - C++",
      "tech": "C++",
      "text": "This project is simple but more complex than C implementation of same system. Project was built through multiple practises during C/C++ course. There is different way to pay, the travel card that is meant for one person use or single ticket option. In the system, each successful payment is put to log. In the project there is focus on pointers and different uses of memory.",
      "gitLink": "https://github.com/Helveeti/Travel-card-system-C-",
      "year": "2021",
      "team": 1
    },
    {
      "id": 2,
      "title": "Simple travel card system - C",
      "tech": "C",
      "text": "This project was simple bigger project end of C course. It was built through several practises. Before this course, I had taken C/C++ course about object-oriented programming with C-languages.",
      "gitLink": "https://github.com/Helveeti/Simple-travel-card-system-C",
      "year": "2021",
      "team": 1
    },
    {
      "id": 3,
      "title": "Multiple C practises",
      "tech": "C",
      "text": "This project includes two bigger projects and tons of smaller practices. Unfortunately, they are all in the same file. This was created in group during our first year of engineering studies and we used these programs to run them on our robot. The same file system worked since we inactivated unnecessary code and run the rest in our robot. These were my first touch to C-languages.",
      "gitLink": "https://github.com/Helveeti/IoT---Robotics/blob/master/main2.c",
      "year": "2019",
      "team": 3
    }
  ]
}
